tutorials/settlingFoam/tank3D/constant/polyMesh/boundary
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           polyBoundaryMesh;
    object          boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
    SYMP3
    {
        type            symmetryPlane;
        physicalType    symmetryPlane;
        startFace       53708;
        nFaces          3191;
    }

    INLE1
    {
        type            patch;
        physicalType    inlet;
        startFace       56899;
        nFaces          45;
    }

    OUTL9
    {
        type            patch;
        physicalType    fixedVelocityOutlet;
        startFace       56944;
        nFaces          11;
    }

    OUTL10
    {
        type            patch;
        physicalType    fixedVelocityOutlet;
        startFace       56955;
        nFaces          11;
    }

    OUTL11
    {
        type            patch;
        physicalType    fixedVelocityOutlet;
        startFace       56966;
        nFaces          11;
    }

    OUTL12
    {
        type            patch;
        physicalType    fixedVelocityOutlet;
        startFace       56977;
        nFaces          11;
    }

    WALL6
    {
        type            wall;
        physicalType    wallFunctions;
        startFace       56988;
        nFaces          1474;
    }

    WALL8
    {
        type            wall;
        physicalType    wallFunctions;
        startFace       58462;
        nFaces          1640;
    }

    WALL61
    {
        type            wall;
        physicalType    wallFunctions;
        startFace       60102;
        nFaces          44;
    }

    WALL62
    {
        type            wall;
        physicalType    wallFunctions;
        startFace       60146;
        nFaces          78;
    }

    WALL63
    {
        type            wall;
        physicalType    wallFunctions;
        startFace       60224;
        nFaces          255;
    }

    WALL64
    {
        type            wall;
        physicalType    wallFunctions;
        startFace       60479;
        nFaces          157;
    }

    WALL65
    {
        type            wall;
        physicalType    wallFunctions;
        startFace       60636;
        nFaces          35;
    }

    WALL66
    {
        type            wall;
        physicalType    wallFunctions;
        startFace       60671;
        nFaces          60;
    }

    WALL67
    {
        type            wall;
        physicalType    wallFunctions;
        startFace       60731;
        nFaces          55;
    }

    WALL68
    {
        type            wall;
        physicalType    wallFunctions;
        startFace       60786;
        nFaces          116;
    }

    WALL69
    {
        type            wall;
        physicalType    wallFunctions;
        startFace       60902;
        nFaces          24;
    }

    WALL7
    {
        type            wall;
        physicalType    wallFunctions;
        startFace       60926;
        nFaces          121;
    }

    WALL70
    {
        type            wall;
        physicalType    wallFunctions;
        startFace       61047;
        nFaces          182;
    }

    OUTL15
    {
        type            patch;
        physicalType    outlet;
        startFace       61229;
        nFaces          14;
    }


)

// ************************************************************************* //
