tutorials/settlingFoam/tank3D/constant/transportProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

muc             muc [1 -1 -1 0 0 0 0] 0.00178;

plasticViscosityCoeff plasticViscosityCoeff [1 -1 -1 0 0 0 0] 0.00023143;

plasticViscosityExponent plasticViscosityExponent [0 0 0 0 0 0 0] 0.17926;

BinghamPlastic  on;

yieldStressCoeff yieldStressCoeff [1 -1 -2 0 0 0 0] 5.5469e-07;

yieldStressExponent yieldStressExponent [0 0 0 0 0 0 0] 95.25;

yieldStressOffset yieldStressOffset [0 0 0 0 0 0 0] 0;

rhoc            rhoc [1 -3 0 0 0 0 0] 1000;

rhod            rhod [1 -3 0 0 0 0 0] 1042;

VdjModel        simple;

simpleCoeffs
{
    V0              V0 [0 1 -1 0 0 0 0] (0 -0.002198 0);
    a               a [0 0 0 0 0 0 0] 8.84;
    a1              a1 [0 0 0 0 0 0 0] 0;
    alphaMin        alphaMin [0 0 0 0 0 0 0] 0;
}

generalCoeffs
{
    V0              V0 [0 1 -1 0 0 0 0] (0 -0.0018 0);
    a               a [0 0 0 0 0 0 0] 1e-05;
    a1              a1 [0 0 0 0 0 0 0] 0.1;
    alphaMin        alphaMin [0 0 0 0 0 0 0] 2e-05;
}


// ************************************************************************* //
